submission_logs/2_2_two_middlewares/32/16/0-1/0/memtier/6.log
1         Threads
16        Connections per thread
80        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets           0.00          ---          ---      0.00000         0.00 
Gets         518.89       513.79         5.10     30.44900      2081.26 
Waits          0.00          ---          ---      0.00000          --- 
Totals       518.89       513.79         5.10     30.44900      2081.26 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
---
GET       1.400         0.00
GET       1.500         0.04
GET       1.600         0.11
GET       1.700         0.31
GET       1.800         0.59
GET       1.900         0.92
GET       2.000         1.29
GET       2.100         1.69
GET       2.200         2.11
GET       2.300         2.52
GET       2.400         2.90
GET       2.500         3.23
GET       2.600         3.47
GET       2.700         3.66
GET       2.800         3.83
GET       2.900         3.98
GET       3.000         4.10
GET       3.100         4.23
GET       3.200         4.33
GET       3.300         4.37
GET       3.400         4.44
GET       3.500         4.52
GET       3.600         4.57
GET       3.700         4.62
GET       3.800         4.67
GET       3.900         4.74
GET       4.000         4.80
GET       4.100         4.85
GET       4.200         4.91
GET       4.300         4.95
GET       4.400         4.98
GET       4.500         5.04
GET       4.600         5.08
GET       4.700         5.14
GET       4.800         5.20
GET       4.900         5.25
GET       5.000         5.30
GET       5.100         5.35
GET       5.200         5.38
GET       5.300         5.42
GET       5.400         5.46
GET       5.500         5.50
GET       5.600         5.57
GET       5.700         5.62
GET       5.800         5.72
GET       5.900         5.80
GET       6.000         5.87
GET       6.100         5.92
GET       6.200         5.99
GET       6.300         6.09
GET       6.400         6.21
GET       6.500         6.33
GET       6.600         6.43
GET       6.700         6.53
GET       6.800         6.63
GET       6.900         6.71
GET       7.000         6.82
GET       7.100         6.91
GET       7.200         7.00
GET       7.300         7.08
GET       7.400         7.18
GET       7.500         7.29
GET       7.600         7.37
GET       7.700         7.45
GET       7.800         7.55
GET       7.900         7.63
GET       8.000         7.69
GET       8.100         7.76
GET       8.200         7.80
GET       8.300         7.88
GET       8.400         7.92
GET       8.500         7.95
GET       8.600         8.03
GET       8.700         8.07
GET       8.800         8.12
GET       8.900         8.17
GET       9.000         8.21
GET       9.100         8.27
GET       9.200         8.33
GET       9.300         8.37
GET       9.400         8.43
GET       9.500         8.50
GET       9.600         8.57
GET       9.700         8.61
GET       9.800         8.67
GET       9.900         8.70
GET      10.000         8.84
GET      11.000         9.16
GET      12.000         9.48
GET      13.000        10.19
GET      14.000        10.69
GET      15.000        16.02
GET      16.000        27.51
GET      17.000        28.73
GET      18.000        28.99
GET      19.000        29.15
GET      20.000        29.24
GET      21.000        29.32
GET      22.000        29.36
GET      23.000        29.38
GET      24.000        29.43
GET      25.000        29.54
GET      26.000        29.65
GET      27.000        29.77
GET      28.000        30.11
GET      29.000        30.71
GET      30.000        33.92
GET      31.000        66.43
GET      32.000        79.42
GET      33.000        80.53
GET      34.000        80.93
GET      35.000        81.15
GET      36.000        81.24
GET      37.000        81.37
GET      38.000        81.46
GET      39.000        81.49
GET      40.000        81.54
GET      41.000        81.60
GET      42.000        81.63
GET      43.000        81.71
GET      44.000        81.87
GET      45.000        82.19
GET      46.000        85.24
GET      47.000        92.11
GET      48.000        92.76
GET      49.000        92.86
GET      50.000        92.92
GET      51.000        92.93
GET      52.000        92.95
GET      53.000        92.99
GET      54.000        93.01
GET      55.000        93.01
GET      56.000        93.01
GET      57.000        93.02
GET      58.000        93.05
GET      59.000        93.07
GET      60.000        93.11
GET      61.000        93.34
GET      62.000        95.47
GET      63.000        96.82
GET      64.000        96.91
GET      65.000        96.95
GET      66.000        96.95
GET      67.000        96.98
GET      68.000        96.98
GET      69.000        96.98
GET      70.000        96.99
GET      71.000        97.01
GET      72.000        97.01
GET      73.000        97.02
GET      74.000        97.03
GET      75.000        97.04
GET      76.000        97.08
GET      77.000        97.32
GET      78.000        98.58
GET      79.000        98.75
GET      80.000        98.77
GET      81.000        98.78
GET      82.000        98.78
GET      85.000        98.79
GET      88.000        98.79
GET      89.000        98.79
GET      91.000        98.79
GET      92.000        98.82
GET      93.000        99.07
GET      94.000        99.43
GET      95.000        99.47
GET      96.000        99.48
GET     100.000        99.49
GET     110.000        99.72
GET     120.000        99.80
GET     130.000        99.84
GET     140.000        99.93
GET     150.000        99.94
GET     160.000        99.96
GET     170.000        99.98
GET     190.000       100.00
---